; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph0 - mode
	image3 - mode
	spectrograph4 - mode
	image1 - mode
	infrared2 - mode
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star1)
	(supports instrument3 image1)
	(calibration_target instrument3 Star4)
	(supports instrument4 image3)
	(supports instrument4 image1)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 image1)
	(supports instrument5 image3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(pointing satellite1 Phenomenon9)
	(have_image Phenomenon5 infrared2)
	(have_image Phenomenon6 image3)
	(have_image Star7 spectrograph4)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon9 image3)
))

)

; plan
1. (turn_to satellite2 star1 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star1)
   goals met: 0 of 6
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 6
3. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 6
4. (turn_to satellite2 phenomenon5 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon5)
   goals met: 0 of 6
5. (turn_to satellite1 phenomenon9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 6
6. (turn_to satellite0 star4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star4)
   goals met: 1 of 6
7. (take_image satellite2 phenomenon5 instrument6 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 2 of 6
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
9. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 6
10. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 6
11. (take_image satellite0 phenomenon6 instrument0 image3)
   added: (have_image phenomenon6 image3)
   goals met: 3 of 6
12. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
13. (take_image satellite0 phenomenon8 instrument0 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 4 of 6
14. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 6
15. (take_image satellite0 phenomenon9 instrument0 image3)
   added: (have_image phenomenon9 image3)
   goals met: 5 of 6
16. (turn_to satellite0 star7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star7)
   goals met: 5 of 6
17. (take_image satellite0 star7 instrument0 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 6 of 6
